OpenNuvoton/NuMicroPy/M55M1/mods/classI2C.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>

#include "py/runtime.h"
#include "py/stream.h"
#include "py/mperrno.h"
#include "py/mphal.h"

#include "classI2C.h"
#include "hal/M55M1_I2C.h"
#include "bufhelper.h"

/// \moduleref pyb
/// \class I2C - a two-wire serial protocol
///
/// I2C is a two-wire protocol for communicating between devices.  At the physical
/// level it consists of 2 wires: SCL and SDA, the clock and data lines respectively.
///
/// I2C objects are created attached to a specific bus.  They can be initialised
/// when created, or initialised later on:
///
///     from pyb import I2C
///
///     i2c = I2C(1)                         # create on bus 1
///     i2c = I2C(1, I2C.MASTER)             # create and init as a master
///     i2c.init(I2C.MASTER, baudrate=20000) # init as a master
///     i2c.init(I2C.SLAVE, addr=0x42)       # init as a slave with given address
///     i2c.deinit()                         # turn off the peripheral
///
/// Printing the i2c object gives you information about its configuration.
///
/// Basic methods for slave are send and recv:
///
///     i2c.send('abc')      # send 3 bytes
///     i2c.send(0x42)       # send a single byte, given by the number
///     data = i2c.recv(3)   # receive 3 bytes
///
/// To receive inplace, first create a bytearray:
///
///     data = bytearray(3)  # create a buffer
///     i2c.recv(data)       # receive 3 bytes, writing them into data
///
/// You can specify a timeout (in ms):
///
///     i2c.send(b'123', timeout=2000)   # timout after 2 seconds
///
/// A master must specify the recipient's address:
///
///     i2c.init(I2C.MASTER)
///     i2c.send('123', 0x42)        # send 3 bytes to slave with address 0x42
///     i2c.send(b'456', addr=0x42)  # keyword for address
///
/// Master also has other methods:
///
///     i2c.is_ready(0x42)           # check if slave 0x42 is ready
///     i2c.scan()                   # scan for slaves on the bus, returning
///                                  #   a list of valid addresses
///     i2c.mem_read(3, 0x42, 2)     # read 3 bytes from memory of slave 0x42,
///                                  #   starting at address 2 in the slave
///     i2c.mem_write('abc', 0x42, 2, timeout=1000)
///                                  #   starting at address 2 in the slave
///     i2c.mem_write('abc', 0x42, 2, timeout=1000)


typedef struct  {
    mp_obj_base_t base;
    int32_t i2c_id;
    i2c_t *psI2CObj;
    I2C_InitTypeDef init;
} pyb_i2c_obj_t;


//#define M55M1_MAX_I2C_INST 5

#define PYB_I2C_MASTER (0)
#define PYB_I2C_SLAVE  (1)

#define PYB_I2C_SPEED_STANDARD (100000L)
#define PYB_I2C_SPEED_FULL     (400000L)
#define PYB_I2C_SPEED_FAST     (1000000L)

#define PYB_I2C_MASTER_ADDRESS (0xfe)

#if defined(MICROPY_HW_I2C0_SCL)
static i2c_t s_sI2C0Obj = {.u_i2c.i2c = I2C0, .bLPI2C = false};
#endif
#if defined(MICROPY_HW_I2C1_SCL)
static i2c_t s_sI2C1Obj = {.u_i2c.i2c = I2C1, .bLPI2C = false};
#endif
#if defined(MICROPY_HW_I2C2_SCL)
static i2c_t s_sI2C2Obj = {.u_i2c.i2c = I2C2, .bLPI2C = false};
#endif
#if defined(MICROPY_HW_I2C3_SCL)
static i2c_t s_sI2C3Obj = {.u_i2c.i2c = I2C3, .bLPI2C = false};
#endif
#if defined(MICROPY_HW_I2C4_SCL)
static i2c_t s_sI2C4Obj = {.u_i2c.lpi2c = LPI2C0, .bLPI2C = true};
#endif

static pyb_i2c_obj_t pyb_i2c_obj[] = {
#if defined(MICROPY_HW_I2C0_SCL)
    {{&machine_i2c_type}, 0, &s_sI2C0Obj},
#else
    {{&machine_i2c_type}, -1, NULL},
#endif

#if defined(MICROPY_HW_I2C1_SCL)
    {{&machine_i2c_type}, 1, &s_sI2C1Obj},
#else
    {{&machine_i2c_type}, -1, NULL},
#endif

#if defined(MICROPY_HW_I2C2_SCL)
    {{&machine_i2c_type}, 2, &s_sI2C2Obj},
#else
    {{&machine_i2c_type}, -1, NULL},
#endif

#if defined(MICROPY_HW_I2C3_SCL)
    {{&machine_i2c_type}, 3, &s_sI2C3Obj},
#else
    {{&machine_i2c_type}, -1, NULL},
#endif

#if defined(MICROPY_HW_I2C4_SCL)
    {{&machine_i2c_type}, 4, &s_sI2C4Obj},
#else
    {{&machine_i2c_type}, -1, NULL},
#endif
};

#define MICROPY_HW_I2C_BAUDRATE_DEFAULT (PYB_I2C_SPEED_STANDARD)
#define MICROPY_HW_I2C_BAUDRATE_MAX (PYB_I2C_SPEED_FAST)

static void pyb_i2c_init(pyb_i2c_obj_t *self)
{
    const pin_obj_t *scl_pin;
    const pin_obj_t *sda_pin;


    if (0) {
#if defined(MICROPY_HW_I2C0_SCL)
    } else if (self->i2c_id == 0) {
        scl_pin = MICROPY_HW_I2C0_SCL;
        sda_pin = MICROPY_HW_I2C0_SDA;
#endif
#if defined(MICROPY_HW_I2C1_SCL)
    } else if (self->i2c_id == 1) {
        scl_pin = MICROPY_HW_I2C1_SCL;
        sda_pin = MICROPY_HW_I2C1_SDA;
#endif
#if defined(MICROPY_HW_I2C2_SCL)
    } else if (self->i2c_id == 2) {
        scl_pin = MICROPY_HW_I2C2_SCL;
        sda_pin = MICROPY_HW_I2C2_SDA;
#endif
#if defined(MICROPY_HW_I2C3_SCL)
    } else if (self->i2c_id == 3) {
        scl_pin = MICROPY_HW_I2C3_SCL;
        sda_pin = MICROPY_HW_I2C3_SDA;
#endif
#if defined(MICROPY_HW_I2C4_SCL)
    } else if (self->i2c_id == 4) {
        scl_pin = MICROPY_HW_I2C4_SCL;
        sda_pin = MICROPY_HW_I2C4_SDA;
#endif
    } else {
        // I2C does not exist for this board (shouldn't get here, should be checked by caller)
        return;
    }

    // init the GPIO lines
//    uint32_t mode = MP_HAL_PIN_MODE_ALT_OPEN_DRAIN;
    uint32_t mode = MP_HAL_PIN_MODE_ALT_PUSH_PULL;

    if(self->i2c_id == 4) { // for LPUART0
        mp_hal_pin_config_alt(scl_pin, mode, AF_FN_LPI2C, 0);
        mp_hal_pin_config_alt(sda_pin, mode, AF_FN_LPI2C, 0);
    } else {
        mp_hal_pin_config_alt(scl_pin, mode, AF_FN_I2C, self->i2c_id);
        mp_hal_pin_config_alt(sda_pin, mode, AF_FN_I2C, self->i2c_id);
    }

    /* I2C clock pin enable schmitt trigger */
    //PA->SMTEN |= GPIO_SMTEN_SMTEN5_Msk;

    // init the I2C device
    if (I2C_Init(self->psI2CObj, &self->init) != 0) {
        // init error
        // TODO should raise an exception, but this function is not necessarily going to be
        // called via Python, so may not be properly wrapped in an NLR handler
        printf("OSError: HAL_I2C_Init failed\n");
        return;
    }
}

static void pyb_i2c_deinit(pyb_i2c_obj_t *self)
{
    const pin_obj_t *scl_pin;
    const pin_obj_t *sda_pin;

