OpenNuvoton/NuMicroPy/M55M1/mods/classI2C.c
    I2C_Final(self->psI2CObj);

    if (0) {
#if defined(MICROPY_HW_I2C0_SCL)
    } else if (self->i2c_id == 0) {
        scl_pin = MICROPY_HW_I2C0_SCL;
        sda_pin = MICROPY_HW_I2C0_SDA;
#endif
#if defined(MICROPY_HW_I2C1_SCL)
    } else if (self->i2c_id == 1) {
        scl_pin = MICROPY_HW_I2C1_SCL;
        sda_pin = MICROPY_HW_I2C1_SDA;
#endif
#if defined(MICROPY_HW_I2C2_SCL)
    } else if (self->i2c_id == 2) {
        scl_pin = MICROPY_HW_I2C2_SCL;
        sda_pin = MICROPY_HW_I2C2_SDA;
#endif
#if defined(MICROPY_HW_I2C3_SCL)
    } else if (self->i2c_id == 3) {
        scl_pin = MICROPY_HW_I2C3_SCL;
        sda_pin = MICROPY_HW_I2C3_SDA;
#endif
#if defined(MICROPY_HW_I2C4_SCL)
    } else if (self->i2c_id == 4) {
        scl_pin = MICROPY_HW_I2C4_SCL;
        sda_pin = MICROPY_HW_I2C4_SDA;
#endif
    } else {
        // I2C does not exist for this board (shouldn't get here, should be checked by caller)
        return;
    }

    mp_hal_pin_config(scl_pin, GPIO_MODE_INPUT, 0);
    mp_hal_pin_config(sda_pin, GPIO_MODE_INPUT, 0);

}

/// \method init(mode, *, addr=0x12, baudrate=400000, gencall=False)
///
/// Initialise the I2C bus with the given parameters:
///
///   - `mode` must be either `I2C.MASTER` or `I2C.SLAVE`
///   - `addr` is the 7-bit address (only sensible for a slave)
///   - `baudrate` is the SCL clock rate (only sensible for a master)
///   - `gencall` is whether to support general call mode
static mp_obj_t pyb_i2c_init_helper(pyb_i2c_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
{
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode,     MP_ARG_INT, {.u_int = PYB_I2C_MASTER} },
        { MP_QSTR_addr,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0x12} },
        { MP_QSTR_baudrate, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = MICROPY_HW_I2C_BAUDRATE_DEFAULT} },
        { MP_QSTR_gencall,  MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
//        { MP_QSTR_dma,      MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // set the I2C configuration values
    I2C_InitTypeDef *init = &self->init;

    if (args[0].u_int == PYB_I2C_MASTER) {
        // use a special address to indicate we are a master
        init->Mode = I2C_MODE_MASTER;
        init->OwnAddress = PYB_I2C_MASTER_ADDRESS;
    } else {
        init->Mode = I2C_MODE_SLAVE;
        init->OwnAddress = args[1].u_int;
    }

    init->BaudRate = args[2].u_int;
    init->GeneralCallMode = args[3].u_bool ? I2C_GCMODE_ENABLE : I2C_GCMODE_DISABLE;

    // init the I2C bus
    pyb_i2c_deinit(self);
    pyb_i2c_init(self);

    if(init->Mode == I2C_MODE_SLAVE) {
        I2C_HookIRQHandler(self->psI2CObj, 0, 0);
    }

    return mp_const_none;
}

/******************************************************************************/
/* MicroPython bindings                                                       */

static inline bool in_master_mode(pyb_i2c_obj_t *self)
{
    return self->init.OwnAddress == PYB_I2C_MASTER_ADDRESS;
}

static void pyb_i2c_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind)
{
    pyb_i2c_obj_t *self = self_in;

    if (self->i2c_id < 0) {
        mp_printf(print, "I2C(%d)", self->i2c_id);
    } else {
        uint32_t baudrate;
        uint32_t address;
        i2c_t *psI2CObj = self->psI2CObj;

        if(psI2CObj->bLPI2C) {
            baudrate = LPI2C_GetBusClockFreq(psI2CObj->u_i2c.lpi2c);
            address = (psI2CObj->u_i2c.lpi2c->ADDR0 >> 1) &0x7f;
        } else {
            baudrate = I2C_GetBusClockFreq(psI2CObj->u_i2c.i2c);
            address = (psI2CObj->u_i2c.i2c->ADDR0 >> 1) &0x7f;
        }


        if (in_master_mode(self)) {
            mp_printf(print, "I2C(%d, I2C.MASTER, baudrate=%u)", self->i2c_id, baudrate);
        } else {
            mp_printf(print, "I2C(%d, I2C.SLAVE, addr=0x%02x)", self->i2c_id, address);
        }
    }
}

/// \classmethod \constructor(bus, ...)
///
/// Construct an I2C object on the given bus.  `bus` can be 0, 1, 2.
/// With no additional parameters, the I2C object is created but not
/// initialised (it has the settings from the last initialisation of
/// the bus, if any).  If extra arguments are given, the bus is initialised.
/// See `init` for parameters of initialisation.
///
/// The physical pins of the I2C busses are:
///
///   - `I2C(0)` is on: `(SCL, SDA) = (D9, D8) = (PA4, PA5)`
///   - `I2C(1)` is on: `(SCL, SDA) = (D13, D10) = (PA2, PA3)`
static mp_obj_t pyb_i2c_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args)
{
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
    // work out i2c bus
    int i2c_id = -1;

    i2c_id = mp_obj_get_int(args[0]);
    if (i2c_id < 0 || i2c_id >= MP_ARRAY_SIZE(pyb_i2c_obj)
        || pyb_i2c_obj[i2c_id].psI2CObj == NULL) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
                                                "I2C(%d) doesn't exist", i2c_id));
    }

    // get I2C object
    pyb_i2c_obj_t *i2c_obj = &pyb_i2c_obj[i2c_id];

    if (n_args > 1 || n_kw > 0) {
        // start the peripheral
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
        pyb_i2c_init_helper(i2c_obj, n_args - 1, args + 1, &kw_args);
    }

    return (mp_obj_t)i2c_obj;
}


static mp_obj_t pyb_i2c_init_(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args)
{
    return pyb_i2c_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2c_init_obj, 1, pyb_i2c_init_);

/// \method deinit()
/// Turn off the I2C bus.
static mp_obj_t pyb_i2c_deinit_(mp_obj_t self_in)
{
    pyb_i2c_obj_t *self = self_in;
    pyb_i2c_deinit(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(pyb_i2c_deinit_obj, pyb_i2c_deinit_);


/// \method is_ready(addr)
/// Check if an I2C device responds to the given address.  Only valid when in master mode.
static mp_obj_t pyb_i2c_is_ready(mp_obj_t self_in, mp_obj_t i2c_addr_o)
{
    pyb_i2c_obj_t *self = self_in;

    if (!in_master_mode(self)) {
        mp_raise_TypeError("I2C must be a master");
    }

