OpenNuvoton/NuMicroPy/M55M1/mods/classI2C.c
    // get the addresses
    mp_uint_t i2c_addr = args[1].u_int;
    mp_uint_t mem_addr = args[2].u_int;

    if (i2c_addr == PYB_I2C_MASTER_ADDRESS) {
        mp_raise_TypeError("addr argument required");
    }

    // determine width of mem_addr; default is 8 bits, entering any other value gives 16 bit width
    mp_uint_t mem_addr_size = 8;
    if (args[4].u_int != 8) {
        mem_addr_size = 16;
    }

    int32_t i32RecvLen = 0;

    if(self->psI2CObj->bLPI2C) {
        if(mem_addr_size == 8)
            i32RecvLen = LPI2C_ReadMultiBytesOneReg(self->psI2CObj->u_i2c.lpi2c, i2c_addr, mem_addr, (uint8_t*)vstr.buf, vstr.len);
        else
            i32RecvLen = LPI2C_ReadMultiBytesTwoRegs(self->psI2CObj->u_i2c.lpi2c, i2c_addr, mem_addr, (uint8_t*)vstr.buf, vstr.len);
    } else {
        if(mem_addr_size == 8)
            i32RecvLen = I2C_ReadMultiBytesOneReg(self->psI2CObj->u_i2c.i2c, i2c_addr, mem_addr, (uint8_t*)vstr.buf, vstr.len);
        else
            i32RecvLen = I2C_ReadMultiBytesTwoRegs(self->psI2CObj->u_i2c.i2c, i2c_addr, mem_addr, (uint8_t*)vstr.buf, vstr.len);
    }

    if(i32RecvLen == 0) {
        mp_hal_raise(HAL_ERROR);
    }

    // return the received data
    if (o_ret != MP_OBJ_NULL) {
        return o_ret;
    } else {
        return mp_obj_new_str_from_vstr(&vstr);
    }
}

static MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2c_mem_read_obj, 1, pyb_i2c_mem_read);

/// \method mem_write(data, addr, memaddr, timeout=5000, addr_size=8)
///
/// Write to the memory of an I2C device:
///
///   - `data` can be an integer or a buffer to write from
///   - `addr` is the I2C device address
///   - `memaddr` is the memory location within the I2C device
///   - `timeout` is the timeout in milliseconds to wait for the write
///   - `addr_size` selects width of memaddr: 8 or 16 bits
///
/// Returns `None`.
/// This is only valid in master mode.

static mp_obj_t pyb_i2c_mem_write(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
{
    // parse args (same as mem_read)
    pyb_i2c_obj_t *self = pos_args[0];
    mp_arg_val_t args[MP_ARRAY_SIZE(pyb_i2c_mem_read_allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(pyb_i2c_mem_read_allowed_args), pyb_i2c_mem_read_allowed_args, args);

    if (!in_master_mode(self)) {
        mp_raise_TypeError("I2C must be a master");
    }

    // get the buffer to write from
    mp_buffer_info_t bufinfo;
    uint8_t data[1];
    pyb_buf_get_for_send(args[0].u_obj, &bufinfo, data);

    // get the addresses
    mp_uint_t i2c_addr = args[1].u_int;
    mp_uint_t mem_addr = args[2].u_int;

    if (i2c_addr == PYB_I2C_MASTER_ADDRESS) {
        mp_raise_TypeError("addr argument required");
    }

    // determine width of mem_addr; default is 8 bits, entering any other value gives 16 bit width
    mp_uint_t mem_addr_size = 8;
    if (args[4].u_int != 8) {
        mem_addr_size = 16;
    }

    int32_t i32WriteLen = 0;

    if(self->psI2CObj->bLPI2C) {
        if(mem_addr_size == 8)
            i32WriteLen = LPI2C_WriteMultiBytesOneReg(self->psI2CObj->u_i2c.lpi2c, i2c_addr, mem_addr, bufinfo.buf, bufinfo.len);
        else
            i32WriteLen = LPI2C_WriteMultiBytesTwoRegs(self->psI2CObj->u_i2c.lpi2c, i2c_addr, mem_addr, bufinfo.buf, bufinfo.len);
    } else {
        if(mem_addr_size == 8)
            i32WriteLen = I2C_WriteMultiBytesOneReg(self->psI2CObj->u_i2c.i2c, i2c_addr, mem_addr, bufinfo.buf, bufinfo.len);
        else
            i32WriteLen = I2C_WriteMultiBytesTwoRegs(self->psI2CObj->u_i2c.i2c, i2c_addr, mem_addr, bufinfo.buf, bufinfo.len);
    }

    if(i32WriteLen != bufinfo.len) {
        mp_hal_raise(HAL_ERROR);
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(pyb_i2c_mem_write_obj, 1, pyb_i2c_mem_write);

static const mp_rom_map_elem_t pyb_i2c_locals_dict_table[] = {
    // instance methods
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&pyb_i2c_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&pyb_i2c_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_is_ready), MP_ROM_PTR(&pyb_i2c_is_ready_obj) },
    { MP_ROM_QSTR(MP_QSTR_scan), MP_ROM_PTR(&pyb_i2c_scan_obj) },
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&pyb_i2c_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&pyb_i2c_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_mem_read), MP_ROM_PTR(&pyb_i2c_mem_read_obj) },
    { MP_ROM_QSTR(MP_QSTR_mem_write), MP_ROM_PTR(&pyb_i2c_mem_write_obj) },

    // class constants
    /// \constant MASTER - for initialising the bus to master mode
    /// \constant SLAVE - for initialising the bus to slave mode
    { MP_ROM_QSTR(MP_QSTR_MASTER), MP_ROM_INT(PYB_I2C_MASTER) },
    { MP_ROM_QSTR(MP_QSTR_SLAVE), MP_ROM_INT(PYB_I2C_SLAVE) },
};

static MP_DEFINE_CONST_DICT(pyb_i2c_locals_dict, pyb_i2c_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_i2c_type,
    MP_QSTR_I2C,
    MP_TYPE_FLAG_NONE,
    make_new, pyb_i2c_make_new,
    print, pyb_i2c_print,
    locals_dict, &pyb_i2c_locals_dict
);



